[Demo_Destiny_ep7_2 GG2CollectionDemoScript]
DemoScripts[0]=(Actor=FADE,Command=SET,SecTime=0,FadeColor=FADE_COLOR_WHITE,FadePriority=FADE_PRIO_FRONT)
DemoScripts[1]=(Actor=CAMERA,Command=SET,SetType=POS,Vec=(X=-1100,Y=-1940,Z=135),SecTime=)
DemoScripts[2]=(Actor=CAMERA,Command=SET,SetType=ROT,Vec=(X=180,Y=-5,Z=0),SecTime=)
DemoScripts[3]=(Actor=CHARACTER,Command=POP,Name="エコロ",GirlProfile=GG2GirlData'GG2GIrlDatas.ProfileData.71_EKORO',Vec=(X=-1290,Y=-1940,Z=0),VecSub=(X=0,Y=0,Z=0),CId=71)
DemoScripts[4]=(Actor=SYSTEM,Command=INIT_WAIT)
DemoScripts[5]=(Actor=CHARACTER,Command=ACTION,Name="エコロ",GirlProfile=GG2GirlData'GG2GIrlDatas.ProfileData.71_EKORO',motionName[0]="ek_CE_0002_lp_open_perplex",motionName[1]="ek_CM_0000_fx_close_normal",motionName[2]="ek_DM_0100_lp_Stand",Rate=0,Number=3,Bit=5)
DemoScripts[6]=(Actor=BGM,Command=PLAY,SecTime=0,SoundID=SoundCue'GG2_BGM_DM_CMN_Decision.GG2_BGM_DM_CMN_Decision_Cue')
DemoScripts[7]=(Actor=AMBIENT,Command=PLAY,SecTime=0,SoundID=SoundCue'AMB_Campus_2.GG2_AMB_Campus_2_LP_Cue')
DemoScripts[8]=(Actor=FADE,Command=EXIT,SecTime=1,FadeColor=FADE_COLOR_WHITE,FadePriority=FADE_PRIO_FRONT)
DemoScripts[9]=(Actor=FADE,Command=WAIT)
DemoScripts[10]=(Actor=WINDOW,Command=SET)
DemoScripts[11]=(Actor=TEXT,Command=SET,ID=TEXT01)
DemoScripts[12]=(Actor=VOICE,Command=PLAY,SoundID=SoundCue'V_DM_Destiny_ep7_2.GG2_V_DES_ep7_2_002_Cue',Name="エコロ")
DemoScripts[13]=(Actor=TEXT,Command=SET,ID=TEXT02)
DemoScripts[14]=(Actor=VOICE,Command=STOP,SoundID=,Name="")
DemoScripts[15]=(Actor=TEXT,Command=SET,ID=TEXT03)
DemoScripts[16]=(Actor=CHARACTER,Command=ACTION,Name="エコロ",GirlProfile=GG2GirlData'GG2GIrlDatas.ProfileData.71_EKORO',motionName[0]="ek_CE_0003_lp_open_surprise",Rate=0,Number=0,Bit=1)
DemoScripts[17]=(Actor=CHARACTER,Command=ACTION,Name="エコロ",GirlProfile=GG2GirlData'GG2GIrlDatas.ProfileData.71_EKORO',motionName[1]="ek_CM_0001_fx_close_down",Rate=0,Number=1,Bit=0)
DemoScripts[18]=(Actor=VOICE,Command=PLAY,SoundID=SoundCue'V_DM_Destiny_ep7_2.GG2_V_DES_ep7_2_004_Cue',Name="エコロ")
DemoScripts[19]=(Actor=TEXT,Command=SET,ID=TEXT04)
DemoScripts[20]=(Actor=VOICE,Command=STOP,SoundID=,Name="")
DemoScripts[21]=(Actor=TEXT,Command=SET,ID=TEXT05)
DemoScripts[22]=(Actor=CHARACTER,Command=ACTION,Name="エコロ",GirlProfile=GG2GirlData'GG2GIrlDatas.ProfileData.71_EKORO',motionName[0]="ek_CE_0001_lp_open_angry",Rate=0,Number=0,Bit=1)
DemoScripts[23]=(Actor=VOICE,Command=PLAY,SoundID=SoundCue'V_DM_Destiny_ep7_2.GG2_V_DES_ep7_2_006_Cue',Name="エコロ")
DemoScripts[24]=(Actor=TEXT,Command=SET,ID=TEXT06)
DemoScripts[25]=(Actor=VOICE,Command=STOP,SoundID=,Name="")
DemoScripts[26]=(Actor=SOUND,Command=PLAY,SoundID=SoundCue'SE_DM_Common.GG2_SE_Manpu_Wonder_Cue')
DemoScripts[27]=(Actor=EMOTION,Command=SET,Name="エコロ",Number=3,CId=71)
DemoScripts[28]=(Actor=CHARACTER,Command=ACTION,Name="エコロ",GirlProfile=GG2GirlData'GG2GIrlDatas.ProfileData.71_EKORO',motionName[0]="ek_CE_0002_lp_open_perplex",motionName[1]="ek_CM_0000_fx_close_normal",motionName[2]="ek_DM_0105_fx_Stand2Seamon",Rate=0,Number=3,Bit=1)
DemoScripts[29]=(Actor=CHARACTER,Command=ACTION,Name="エコロ",GirlProfile=GG2GirlData'GG2GIrlDatas.ProfileData.71_EKORO',motionName[2]="ek_DM_0500_lp_Sermon",Number=8)
DemoScripts[30]=(Actor=VOICE,Command=PLAY,SoundID=SoundCue'V_DM_Destiny_ep7_2.GG2_V_DES_ep7_2_007_Cue',Name="エコロ")
DemoScripts[31]=(Actor=TEXT,Command=SET,ID=TEXT07)
DemoScripts[32]=(Actor=VOICE,Command=STOP,SoundID=,Name="")
DemoScripts[33]=(Actor=CHARACTER,Command=ACTION,Name="エコロ",GirlProfile=GG2GirlData'GG2GIrlDatas.ProfileData.71_EKORO',motionName[2]="ek_DM_0501_fx_Seamon2Stand",Rate=0,Number=2,Bit=0)
DemoScripts[34]=(Actor=CHARACTER,Command=ACTION,Name="エコロ",GirlProfile=GG2GirlData'GG2GIrlDatas.ProfileData.71_EKORO',motionName[2]="ek_DM_0100_lp_Stand",Number=8)
DemoScripts[35]=(Actor=TEXT,Command=SET,ID=TEXT08)
DemoScripts[36]=(Actor=WINDOW,Command=EXIT)
DemoScripts[37]=(Actor=ICON,Command=START,CId=0,Bit=0)
DemoScripts[38]=(Actor=ICON,Command=SET,CId=3,Bit=3)
DemoScripts[39]=(Actor=ICON,Command=WAIT,CId=0,Bit=0)
DemoScripts[40]=(Actor=WINDOW,Command=SET)
DemoScripts[41]=(Actor=TEXT,Command=SET,ID=TEXT09)
DemoScripts[42]=(Actor=WINDOW,Command=EXIT)
DemoScripts[43]=(Actor=CHARACTER,Command=ACTION,Name="エコロ",GirlProfile=GG2GirlData'GG2GIrlDatas.ProfileData.71_EKORO',motionName[0]="ek_CE_0003_lp_open_surprise",motionName[1]="ek_CM_0001_fx_close_down",motionName[2]="ek_DM_0106_fx_Stand2Surprise",Rate=0,Number=3,Bit=1)
DemoScripts[44]=(Actor=CHARACTER,Command=ACTION,Name="エコロ",GirlProfile=GG2GirlData'GG2GIrlDatas.ProfileData.71_EKORO',motionName[2]="ek_DM_0600_lp_Surprise",Number=8)
DemoScripts[45]=(Actor=SOUND,Command=PLAY,SoundID=SoundCue'SE_DM_Destiny_ep7_2.GG2_SE_DM_Letter_Open_Cue')
DemoScripts[46]=(Actor=ICON,Command=EXIT,CId=3,Bit=3)
DemoScripts[47]=(Actor=ICON,Command=WAIT,CId=0,Bit=0)
DemoScripts[48]=(Actor=WINDOW,Command=SET)
DemoScripts[49]=(Actor=TEXT,Command=SET,ID=TEXT10)
DemoScripts[50]=(Actor=TEXT,Command=SET,ID=TEXT11)
DemoScripts[51]=(Actor=VOICE,Command=PLAY,SoundID=SoundCue'V_DM_Destiny_ep7_2.GG2_V_DES_ep7_2_012_Cue',Name="エコロ")
DemoScripts[52]=(Actor=TEXT,Command=SET,ID=TEXT12)
DemoScripts[53]=(Actor=VOICE,Command=STOP,SoundID=,Name="")
DemoScripts[54]=(Actor=TEXT,Command=SET,ID=TEXT13)
DemoScripts[55]=(Actor=BGM,Command=STOP,SecTime=1,SoundID=)
DemoScripts[56]=(Actor=CHARACTER,Command=ACTION,Name="エコロ",GirlProfile=GG2GirlData'GG2GIrlDatas.ProfileData.71_EKORO',motionName[0]="ek_CE_0001_lp_open_angry",motionName[1]="ek_CM_0001_fx_close_down",motionName[2]="ek_DM_0601_fx_Surprise2Stand",Rate=0,Number=3,Bit=1)
DemoScripts[57]=(Actor=CHARACTER,Command=ACTION,Name="エコロ",GirlProfile=GG2GirlData'GG2GIrlDatas.ProfileData.71_EKORO',motionName[2]="ek_DM_0100_lp_Stand",Number=8)
DemoScripts[58]=(Actor=SYSTEM,Command=WAIT,SecTime=1)
DemoScripts[59]=(Actor=BGM,Command=PLAY,SecTime=0,SoundID=SoundCue'GG2_BGM_DM_Usual_Others.GG2_BGM_DM_Usual_Others_Cue')
DemoScripts[60]=(Actor=VOICE,Command=PLAY,SoundID=SoundCue'V_DM_Destiny_ep7_2.GG2_V_DES_ep7_2_014_Cue',Name="エコロ")
DemoScripts[61]=(Actor=TEXT,Command=SET,ID=TEXT14)
DemoScripts[62]=(Actor=VOICE,Command=STOP,SoundID=,Name="")
DemoScripts[63]=(Actor=TEXT,Command=SET,ID=TEXT15)
DemoScripts[64]=(Actor=VOICE,Command=PLAY,SoundID=SoundCue'V_DM_Destiny_ep7_2.GG2_V_DES_ep7_2_016_Cue',Name="エコロ")
DemoScripts[65]=(Actor=TEXT,Command=SET,ID=TEXT16)
DemoScripts[66]=(Actor=VOICE,Command=STOP,SoundID=,Name="")
DemoScripts[67]=(Actor=TEXT,Command=SET,ID=TEXT17)
DemoScripts[68]=(Actor=CHARACTER,Command=ACTION,Name="エコロ",GirlProfile=GG2GirlData'GG2GIrlDatas.ProfileData.71_EKORO',motionName[0]="ek_CE_0000_lp_open_normal",Rate=0,Number=0,Bit=1)
DemoScripts[69]=(Actor=CHARACTER,Command=ACTION,Name="エコロ",GirlProfile=GG2GirlData'GG2GIrlDatas.ProfileData.71_EKORO',motionName[1]="ek_CM_0002_fx_close_smile_S",Rate=0,Number=1,Bit=0)
DemoScripts[70]=(Actor=VOICE,Command=PLAY,SoundID=SoundCue'V_DM_Destiny_ep7_2.GG2_V_DES_ep7_2_018_Cue',Name="エコロ")
DemoScripts[71]=(Actor=TEXT,Command=SET,ID=TEXT18)
DemoScripts[72]=(Actor=VOICE,Command=STOP,SoundID=,Name="")
DemoScripts[73]=(Actor=CHARACTER,Command=ACTION,Name="エコロ",GirlProfile=GG2GirlData'GG2GIrlDatas.ProfileData.71_EKORO',motionName[0]="ek_CE_0100_fx_close_normal",motionName[1]="ek_CM_0003_fx_close_smile_L",motionName[2]="ek_DM_0104_fx_Stand2Pray",Rate=0,Number=3,Bit=0)
DemoScripts[74]=(Actor=CHARACTER,Command=ACTION,Name="エコロ",GirlProfile=GG2GirlData'GG2GIrlDatas.ProfileData.71_EKORO',motionName[2]="ek_DM_0400_lp_Pray",Number=8)
DemoScripts[75]=(Actor=VOICE,Command=PLAY,SoundID=SoundCue'V_DM_Destiny_ep7_2.GG2_V_DES_ep7_2_019_Cue',Name="エコロ")
DemoScripts[76]=(Actor=TEXT,Command=SET,ID=TEXT19)
DemoScripts[77]=(Actor=VOICE,Command=STOP,SoundID=,Name="")
DemoScripts[78]=(Actor=CHARACTER,Command=ACTION,Name="エコロ",GirlProfile=GG2GirlData'GG2GIrlDatas.ProfileData.71_EKORO',motionName[0]="ek_CE_0101_fx_close_smile",motionName[1]="ek_CM_0003_fx_close_smile_L",motionName[2]="ek_DM_0401_fx_Pray2Stand",Rate=0,Number=3,Bit=0)
DemoScripts[79]=(Actor=CHARACTER,Command=ACTION,Name="エコロ",GirlProfile=GG2GirlData'GG2GIrlDatas.ProfileData.71_EKORO',motionName[2]="ek_DM_0100_lp_Stand",Number=8)
DemoScripts[80]=(Actor=VOICE,Command=PLAY,SoundID=SoundCue'V_DM_Destiny_ep7_2.GG2_V_DES_ep7_2_020_Cue',Name="エコロ")
DemoScripts[81]=(Actor=TEXT,Command=SET,ID=TEXT20)
DemoScripts[82]=(Actor=VOICE,Command=STOP,SoundID=,Name="")
DemoScripts[83]=(Actor=TEXT,Command=SET,ID=TEXT21)
DemoScripts[84]=(Actor=WINDOW,Command=EXIT)
DemoScripts[85]=(Actor=FADE,Command=SET,SecTime=1,FadeColor=FADE_COLOR_WHITE,FadePriority=FADE_PRIO_FRONT)
DemoScripts[86]=(Actor=BGM,Command=STOP,SecTime=2,SoundID=)
DemoScripts[87]=(Actor=AMBIENT,Command=STOP,SecTime=2,SoundID=)
DemoScripts[88]=(Actor=SYSTEM,Command=WAIT,SecTime=2)
DemoScripts[89]=(Actor=SYSTEM,Command=END)

[Select_Destiny_ep7_2 GG2CollectionSelect]
Selects[0]=(Label="SELECT00",SelectNumber=5,Select[0]=(TextLabel="SELECT01",Goto="JUMP01",ParamType=NO_PARAM,ParamNum=0),Select[1]=(TextLabel="SELECT02",Goto="JUMP02",ParamType=NO_PARAM,ParamNum=0),Select[2]=(TextLabel="SELECT03",Goto="JUMP03",ParamType=NO_PARAM,ParamNum=0),Select[3]=(TextLabel="SELECT04",Goto="JUMP04",ParamType=NO_PARAM,ParamNum=0),Select[4]=(TextLabel="SELECT05",Goto="JUMP05",ParamType=NO_PARAM,ParamNum=0))
Selects[1]=(Label="SELECT01",SelectNumber=5,Select[0]=(TextLabel="SELECT06",Goto="JUMP06",ParamType=NO_PARAM,ParamNum=0),Select[1]=(TextLabel="SELECT07",Goto="JUMP07",ParamType=NO_PARAM,ParamNum=0),Select[2]=(TextLabel="SELECT08",Goto="JUMP08",ParamType=NO_PARAM,ParamNum=0),Select[3]=(TextLabel="SELECT09",Goto="JUMP09",ParamType=NO_PARAM,ParamNum=0),Select[4]=(TextLabel="SELECT10",Goto="JUMP10",ParamType=NO_PARAM,ParamNum=0))

[Text_Destiny_ep7_2 GG2CollectionText]
Texts[0]=(Label="TEXT01",Name="峯大",Text="............")

Texts[1]=(Label="TEXT02",Name="艾可蘿",Text="峯大大人,你在沉思什麼啊?/n已經沒剩多少時間了耶?")

Texts[2]=(Label="TEXT03",Name="峯大",Text="沒有啦,我只是稍微整理一下自己的心情......")

Texts[3]=(Label="TEXT04",Name="艾可蘿",Text="難道說,你有找到/n感到在意的女孩子了嗎?")

Texts[4]=(Label="TEXT05",Name="峯大",Text="......嗯./n真虧妳能明白耶.")

Texts[5]=(Label="TEXT06",Name="艾可蘿",Text="我已經說了很多次,/n因為我是精英天使啊./n然後,峯大大人,是哪位......咦,奇怪?")

Texts[6]=(Label="TEXT07",Name="艾可蘿",Text="峯大大人,那是什麼?/n你口袋裡面的東西......")

Texts[7]=(Label="TEXT08",Name="峯大",Text="口袋......?")

Texts[8]=(Label="TEXT09",Name="峯大",Text="咦,這什麼啊?/n一封信......?")

Texts[9]=(Label="TEXT10",Name="峯大",Text="\"放學後在屋頂上等你\"/n......這是情書?")

Texts[10]=(Label="TEXT11",Name="峯大",Text="是在我到處讓女孩子昇天的時候/n放進了我的口袋裡嗎?")

Texts[11]=(Label="TEXT12",Name="艾可蘿",Text="那......那是!")

Texts[12]=(Label="TEXT13",Name="峯大",Text="艾可蘿?")

Texts[13]=(Label="TEXT14",Name="艾可蘿",Text="那封信,那篇文章!/n我的感應器嗡嗡作響了!/n那封信的主人就是命運的對象!")

Texts[14]=(Label="TEXT15",Name="峯大",Text="真......真的嗎?/n不是因為快到時間限制/n才亂說的吧?")

Texts[15]=(Label="TEXT16",Name="艾可蘿",Text="既然你這麼想,就請看一下屬名吧./n那封信是誰寫給你的呢?")

Texts[16]=(Label="TEXT17",Name="峯大",Text="......!/n......這個人是......")

Texts[17]=(Label="TEXT18",Name="艾可蘿",Text="她是峯大大人/n現在感到在意的人,對吧?")

Texts[18]=(Label="TEXT19",Name="艾可蘿",Text="命運是一種會互相吸引的東西....../n引力就是愛!!")

Texts[19]=(Label="TEXT20",Name="艾可蘿",Text="走吧,去迎接命運的女朋友吧!")

Texts[20]=(Label="TEXT21",Name="峯大",Text="嗯,到屋頂去!")

Texts[21]=(Label="",Name="",Text="")

Texts[22]=(Label="SELECT01",Name="",Text="")

Texts[23]=(Label="SELECT02",Name="",Text="")

Texts[24]=(Label="SELECT03",Name="",Text="")

Texts[25]=(Label="SELECT04",Name="",Text="")

Texts[26]=(Label="SELECT05",Name="",Text="")

Texts[27]=(Label="SELECT06",Name="",Text="")

Texts[28]=(Label="SELECT07",Name="",Text="")

Texts[29]=(Label="SELECT08",Name="",Text="")

Texts[30]=(Label="SELECT09",Name="",Text="")

Texts[31]=(Label="SELECT10",Name="",Text="")


